Revit 2026 API

# TopographySurfaceFindPoints Method

---

Filters and returns only the points of the topography surface which lie within the input bounding box.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<XYZ> FindPoints(
	Outline boundingBox
)
```
```vb
Public Function FindPoints (
	boundingBox As Outline
) As IList(Of XYZ)
```
```cpp
public:
IList<XYZ^>^ FindPoints(
	Outline^ boundingBox
)
```
```fsharp
member FindPoints :
        boundingBox : Outline -> IList<XYZ>
```

#### Parameters

boundingBox Outline
     The 3D bounding box.

#### Return Value

IListXYZ The result points within the 3D bounding box

| Exception | Condition |
| --- | --- |
| ArgumentException | boundingBox is an empty Outline. |
| ArgumentNullException | A non-optional argument was null |

This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace